Repository: djmslimani/MyDeliciousRecipesApp
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: العربية

source: Search
ar: بحث

source: Refresh
ar: تحديث

source: Settings
ar: الإعدادات

source: About
ar: حول البرنامج

source: Close
ar: إغلاق

source: Add
ar: إضافة

# searchfor
source: Search for a recipe
ar: البحث عن وصفة

source: Yes
ar: نعم

source: No
ar: لا

# passwordinfo
source: This password is used to protect recipes from modification or deletion, from someone who is not familiar with the App, it can be modified or deleted at any time.
ar: هذا الرمز يُستخدم لحماية الوصفات من التعديل أو الحذف من شخص لا يُحسن استخدام البرنامج، ويمكن تعديله أو حذفه في أي وقت.

# enterpassword
source: Enter your password
ar: أدخل رمز الحماية

source: Save
ar: حفظ

# exitmessage
source: Are you sure you want to leave?
ar: هل تود الخروج من التطبيق؟

# editordelete
source: Modification or deletion
ar: تعديل أو حذف

source: Delete
ar: حذف

source: Change
ar: تعديل

# modifyordeletepasswordinfo
source: You have already added the password! If you want to change it, press Change or press Delete to delete it.
ar: لقد أضفت رمز الحماية بالفعل! إذا أردت تعديل الرمز اضغط على تعديل، وإذا أردت حذفه اضغط على حذف.

source: Old password
ar: رمز الحماية القديم

source: New password
ar: رمز الحماية الجديد

# cannotbeemty
source: Cannot be empty!
ar: لا يمكن أن يكون فارغًا!

# noresults
source: No results found!
ar: لا توجد نتائج!

# numberofresults
source: Number of recipes found is:
ar: عدد الوصفات المُتحصل عليها هو:

source: Password added.
ar: تم إضافة رمز الحماية.

source: Password changed.
ar: تم تعديل رمز الحماية.

# wrongpassword
source: The old password is wrong!
ar: رمز الحماية القديم خطأ!

source: Password deleted.
ar: تم حذف رمز الحماية.

source: Meals
ar: وجبات

source: Desserts
ar: حلويات

# deliciousrecipes
source: My Delicious Recipes
ar: وصفاتي الشهية

# apppurpose
source: The purpose of this app is to save the prepared recipes and make them available in anytime and anywhere.
ar: هدف هذا البرنامج هو حفظ الوصفات المُعدة، لتسهيل الوصول إليها في أي وقت وأي مكان.

source: Version
ar: النسخة

# versionnumber
source: Version: 1.0.0.
ar: نسخة البرنامج: 1.0.0.

# releasedate
source: Release date: March, 2023.
ar: تاريخ الصدور: مارس 2023.

source: Contact
ar: الاتصال

# contactemail
source: If you require any further information, feel free to contact me:
ar: يمكنكم التواصل عبر البريد الإلكتروني التالي:

# nopicture
source: You have not chosen a picture!
ar: لم تقم باختيار صورة!

# chooserecipe
source: Recipe type
ar: نوع الوصفة

# recipeexists
source: This recipe exists!
ar: هذه الوصفة موجودة!

# successfullysaved
source: New recipe successfully added.
ar: تم إضافة وصفة جديدة بنجاح.

source: Recipe
ar: الوصفة

source: Ingredients
ar: المكونات

source: Method
ar: طريقة التحضير

source: Add a picture
ar: إضافة صورة

# imagesource
source: Select the image source
ar: حدد مصدر الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Successfully changed.
ar: تم التعديل بنجاح.

source: Change the picture
ar: تعديل الصورة

# deletemessage
source: Are you sure you want to delete it?
ar: هل تريد حذف هذه الوصفة؟

# preserverecipesmessage
source: Do you want to preserve the existing recipes?
ar: هل تريد الإحتفاظ بالوصفات الموجودة؟

source: Successfully deleted.
ar: تم الحذف بنجاح.

# norecipetype
source: You have not chosen the recipe type!
ar: لم تقم باختيار نوع الوصفة!

source: Secuirity
ar: الأمان

# applanguage
source: Language
ar: اللغة

source: Password
ar: رمز الحماية

# arabiclanguage
source: Arabic
ar: العربية

# englishlanguage
source: English
ar: الإنجليزية

# frenchlanguage
source: French
ar: الفرنسية

source: Internal storage
ar: وحدة التخزين الداخلية

source: External storage
ar: وحدة التخزين الخارجية

source: Empty folder.
ar: مجلد فارغ.

source: Backup
ar: النسخ الإحتياطي

source: Restore
ar: الإستعادة

source: Unsupported image type!
ar: نوع الصورة غير مدعوم!

source: Unsupported file type!
ar: نوع الملف غير مدعوم!

# notavalidfile
source: This is not a valid file!
ar: هذا الملف ليس ملفًا صالحًا!

source: Restore completed successfully
ar: تمت الإستعادة بنجاح

source: Backup completed successfully
ar: تم النسخ الإحتياطي بنجاح

source: Copying, please wait...
ar: يتم النسخ، يرجى الإنتظار...

source: Restoring, please wait...
ar: يتم الإستعادة، يرجى الإنتظار...

# norecipetobackup
source: There is no recipe to backup!
ar: لا توجد وصفات للنسخ!

source: Cloud storage
ar: التخزين السحابي

source: Local storage
ar: التخزين المحلي

# backupinfo
source: Local backup path:
ar: مسار النسخ الاحتياطي المحلي:

# restoreinfo
source: - By clicking the restore button you will open the default backup folder, then choose the backup to be restored. You can also search for another backup on your device (local storage or SD card). - You can rename the backup file, but please keep the .MyDeliciousRecipesBackup part of the filename intact.
ar: - بالنقر على زر الإستعادة ستنتقل إلى مجلد النسخ الإحتياطي الإفتراضي، وبعدها اختر النسخة الإحتياطية المراد استرجاعها. يمكنك أيضًا البحث في جهازك (التخزين الداخلي أو الخارجي) عن نسخة احتياطية أخرى. - يمكنك تغيير اسم النسخة الاحتياطية، ولكن احتفظ بالجزء .MyDeliciousRecipesBackup كما هو.

source: Themes
ar: الثيمات

source: Voice typing
ar: الكتابة بالصوت

# voicetypinginfo1
source: - This feature requires an internet connection.
ar: - هذه الخاصية تتطلب الاتصال بالإنترنت.

# voicetypinginfo2
source: - At the top of your keyboard, tap Microphone
ar: - في أعلى لوحة المفاتيح، انقر على رمز الميكروفون

# voicetypinginfo3
source: Then, dictate your text.
ar: بعد ذلك، قل ما تريد كتابته.

# voicetypinginfo4
source: - If the Microphone icon is missing from your Keyboard, tap Settings
ar: - إذا لم يكن رمز الميكروفون ظاهرًا على لوحة المفاتيح، اضغط على رمز الإعدادات

# voicetypinginfo5
source: Tap Voice typing, then turn Use voice typing on. The Microphone should now be available.
ar: اضغط على الكتابة بالصوت، ثم فعل استخدام الكتابة بالصوت. وسيظهر رمز الميكروفون على لوحة المفاتيح.

# voicetypinginfo6
source: - If the Settings icon is missing from your Keyboard, touch and hold the comma ',' in the bottom left of your keyboard, then drag your finger to the Settings icon.
ar: - إذا لم يكن رمز الإعدادات ظاهرًا على لوحة المفاتيح، اضغط مع الاستمرار على رمز الفاصلة ',' وسيظهر رمز الإعدادات.

# shareaspdf
source: Share (*.pdf)
ar: مشاركة (*.pdf)

# shareasappformat
source: Share (*.MyDeliciousRecipesBackup)
ar: مشاركة (*.MyDeliciousRecipesBackup)

source: Operation completed
ar: تمت العملية

# requiredpermission
source: This permission is required
ar: هذا الإذن مطلوب

# grantpermission
source: Grant the permission
ar: منح الإذن

source: App Settings
ar: إعدادات التطبيق

# grantpermissionfromappsettings
source: You need to give this permission from the App Settings.
ar: تحتاج إلى منح هذا الإذن من إعدادات التطبيق.

# grantpermissionmethod
source: App Settings -> Permissions -> Storage -> Allow
ar: إعدادات التطبيق -> الأذونات -> التخزين -> سماح

# recipesnumber
source: This feature requires more than one recipe.
ar: هذه الخاصية تتطلب أكثر من وصفة واحدة.

source: Privacy policy
ar: سياسة الخصوصية
